# DataFrames

* DataFrames, look very similar to tables in excel.
* Creating dataframes from scratch isn't what you would usually do - you would pull data from a .CSV file or the web, but let's create one for an example:

In [45]:
import pandas as pd
import numpy as np

* First, we create the DataFrame - refering to pd which is the import we did and then calling the DataFrame.
* Then, we add () and {} since it's structure is similar to a dictionary
* Last, we give the name of the columns and then the values in [] since it's a list

In [46]:

cust=pd.DataFrame({
"NumberPlate":["KVY975","MNP452","KSM237","MNM153"],
"ClientName":["Nick","Andrew","Michael","Joanna"],
"Model":["XC40","V90","XC90","S60"],
"Trim":["Momentum Pro","R-Design pro","Inscripion Pro","R-Design"],    
"Engine Trim":["D3","T4","T8 Twin Engine","D5"],
"Price":[38000,46000,70000,40000]})

In [47]:
cust

  NumberPlate ClientName Model            Trim     Engine Trim  Price
0      KVY975       Nick  XC40    Momentum Pro              D3  38000
1      MNP452     Andrew   V90    R-Design pro              T4  46000
2      KSM237    Michael  XC90  Inscripion Pro  T8 Twin Engine  70000
3      MNM153     Joanna   S60        R-Design              D5  40000

* So, where's the similarity with series?
    * A column of a DataFrame is a series, so the same rules apply.
        * You can change the indexes of the values of a column:

* By writting the name that we assigned to the dataframe.columns, we can see all the columns of the it - the culumns  attribute

In [48]:
cust.columns

Index(['NumberPlate', 'ClientName', 'Model', 'Trim', 'Engine Trim', 'Price'], dtype='object')

* Using the same mindset, we can get more info

In [49]:
cust.index

RangeIndex(start=0, stop=4, step=1)

In [50]:
cust.size

24

        * Null = empty

In [51]:
cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   NumberPlate  4 non-null      object
 1   ClientName   4 non-null      object
 2   Model        4 non-null      object
 3   Trim         4 non-null      object
 4   Engine Trim  4 non-null      object
 5   Price        4 non-null      int64
dtypes: int64(1), object(5)
memory usage: 320.0+ bytes

* A dataframe, is similar to a numpy matrix array, where 4,5 meant 4 rows and 5 columns, Basic:

In [52]:
cust.shape

(4, 6)

In [53]:
cust.describe()

              Price
count      4.000000
mean   48500.000000
std    14730.919863
min    38000.000000
25%    39500.000000
50%    43000.000000
75%    52000.000000
max    70000.000000

In [54]:
cust.dtypes

NumberPlate    object
ClientName     object
Model          object
Trim           object
Engine Trim    object
Price           int64
dtype: object

In [55]:
cust.dtypes.value_counts()

object    5
int64     1
dtype: int64

# Indexing and Slicing

* Each column, can be called up and represented as a series.

In [56]:
cust

  NumberPlate ClientName Model            Trim     Engine Trim  Price
0      KVY975       Nick  XC40    Momentum Pro              D3  38000
1      MNP452     Andrew   V90    R-Design pro              T4  46000
2      KSM237    Michael  XC90  Inscripion Pro  T8 Twin Engine  70000
3      MNM153     Joanna   S60        R-Design              D5  40000

* Using the loc attribute, we can call a row using its index

* As we learnt in the previous tutorial(01 - Pandas), we can use the .iloc[] attribute to call rows using their original indexes
* values bellow 0, start counting backwards from the last element

In [57]:
cust.iloc[-1]

NumberPlate      MNM153
ClientName       Joanna
Model               S60
Trim           R-Design
Engine Trim          D5
Price             40000
Name: 3, dtype: object

In [58]:
cust["ClientName"]

0       Nick
1     Andrew
2    Michael
3     Joanna
Name: ClientName, dtype: object

* All the things that re being returned are series
* The index, is returned as the name of the series
* When the index of the df is numeric, you may have some issues with calling the rows

* You an also call a range of items and choose which columns to print:

In [59]:
cust.loc["KVY975":"KSM237",["Model","Price"]]

Empty DataFrame
Columns: [Model, Price]
Index: []

In [60]:
cust.iloc[1:3,[0,2]]

  NumberPlate Model
1      MNP452   V90
2      KSM237  XC90

# Boolean Arrays

* They work the same way as demonstrated before. Here are some quick examples:

In [61]:
cust["Price"]>45000

0    False
1     True
2     True
3    False
Name: Price, dtype: bool

In [62]:
cust.loc[cust["Price"]>45000,["ClientName","Model","Price"]]

  ClientName Model  Price
1     Andrew   V90  46000
2    Michael  XC90  70000

In [63]:
cust

  NumberPlate ClientName Model            Trim     Engine Trim  Price
0      KVY975       Nick  XC40    Momentum Pro              D3  38000
1      MNP452     Andrew   V90    R-Design pro              T4  46000
2      KSM237    Michael  XC90  Inscripion Pro  T8 Twin Engine  70000
3      MNM153     Joanna   S60        R-Design              D5  40000

* You can use all the different methods we learned prior to drop something with different ways

# OPERATIONS

* You can rename columns and indexes using .rename like so: 
    * Again, in order to save the changes, you have to assign them to the variable again

In [64]:
cust=cust.rename(columns={"ClientName": "CustomerName"})

* You can also do changes to the numbers using * / - + ^

In [65]:
cust["Price"]/100

0    380.0
1    460.0
2    700.0
3    400.0
Name: Price, dtype: float64

* But, no changes are going to be made to the actual dataframe. In order to change it, we have to assign the new value to it again: cust=cust["Price"]/100

* We can also set a culumn 'marker' as an index

In [66]:
cust.set_index('CustomerName')

             NumberPlate Model            Trim     Engine Trim  Price
CustomerName
Nick              KVY975  XC40    Momentum Pro              D3  38000
Andrew            MNP452   V90    R-Design pro              T4  46000
Michael           KSM237  XC90  Inscripion Pro  T8 Twin Engine  70000
Joanna            MNM153   S60        R-Design              D5  40000

* Or create Multiple indexes

In [67]:
cust=cust.set_index(["CustomerName","Price"])

In [68]:
cust

                   NumberPlate Model            Trim     Engine Trim
CustomerName Price
Nick         38000      KVY975  XC40    Momentum Pro              D3
Andrew       46000      MNP452   V90    R-Design pro              T4
Michael      70000      KSM237  XC90  Inscripion Pro  T8 Twin Engine
Joanna       40000      MNM153   S60        R-Design              D5

* And reset the indexes that we set

In [69]:
cust.reset_index()

  CustomerName  Price NumberPlate Model            Trim     Engine Trim
0         Nick  38000      KVY975  XC40    Momentum Pro              D3
1       Andrew  46000      MNP452   V90    R-Design pro              T4
2      Michael  70000      KSM237  XC90  Inscripion Pro  T8 Twin Engine
3       Joanna  40000      MNM153   S60        R-Design              D5

# Modifying DataFrames

In [70]:
pop=pd.DataFrame({
    "country":["france","denmark","greece","poland","cyprus"],
    "population in m":[67.060,5.806,10.720,37.970,1.212],
    "capital":["paris","copenhagen","athens","wrsaw","nicosia"],
    "is in EU":[True,True,True,True,True],
    "toDrop":[1,2,3,4,5]
})

In [71]:
pop

   country  population in m     capital  is in EU  toDrop
0   france           67.060       paris      True       1
1  denmark            5.806  copenhagen      True       2
2   greece           10.720      athens      True       3
3   poland           37.970       wrsaw      True       4
4   cyprus            1.212     nicosia      True       5

* Deleting/dropping a column
* Dropping means removing a row (Temporarily - in order to save the new df (DataFrame), you have to save it in a variable again)

In [72]:
del pop["toDrop"]

In [73]:
pop

   country  population in m     capital  is in EU
0   france           67.060       paris      True
1  denmark            5.806  copenhagen      True
2   greece           10.720      athens      True
3   poland           37.970       wrsaw      True
4   cyprus            1.212     nicosia      True

In [74]:
pop=pd.DataFrame({
    "country":["france","denmark","greece","poland","cyprus"],
    "population in m":[67.060,5.806,10.720,37.970,1.212],
    "GDP in billions, USD":[2716,350.1,209.9,595.9,24.95],
    "capital":["paris","copenhagen","athens","wrsaw","nicosia"],
    "is in EU":[True,True,True,True,True],
    "toDrop":[1,2,3,4,5]
})

In [75]:
pop.drop(pop.index[4])

,country,population in m,"GDP in billions, USD",capital,is in EU,toDrop
0,france,67.060,2716.0,paris,True,1
1,denmark,5.806,350.1,copenhagen,True,2
2,greece,10.720,209.9,athens,True,3
3,poland,37.970,595.9,wrsaw,True,4

* We have dropped a row from the pop DF. You can use all the different ways we learnt before to drop either a row or column.

* Replacing values in a column:
    * We replaced all values to False (maybe not valid,but its just for demonstration)

In [76]:
pop["is in EU"]=False

In [77]:
pop

,country,population in m,"GDP in billions, USD",capital,is in EU,toDrop
0,france,67.060,2716.00,paris,False,1
1,denmark,5.806,350.10,copenhagen,False,2
2,greece,10.720,209.90,athens,False,3
3,poland,37.970,595.90,wrsaw,False,4
4,cyprus,1.212,24.95,nicosia,False,5

In [78]:
pop["is in EU"]=True

* Pulling Data from DF

In [79]:
pop["GDP in billions, USD"]/pop["population in m"]

0    40.501044
1    60.299690
2    19.580224
3    15.693969
4    20.585809
dtype: float64

# Statistical Information

In [80]:
pop.describe()

       population in m  GDP in billions, USD    toDrop
count          5.00000              5.000000  5.000000
mean          24.55360            779.370000  3.000000
std           27.72393           1102.487568  1.581139
min            1.21200             24.950000  1.000000
25%            5.80600            209.900000  2.000000
50%           10.72000            350.100000  3.000000
75%           37.97000            595.900000  4.000000
max           67.06000           2716.000000  5.000000

In [81]:
pop.head()

,country,population in m,"GDP in billions, USD",capital,is in EU,toDrop
0,france,67.060,2716.00,paris,True,1
1,denmark,5.806,350.10,copenhagen,True,2
2,greece,10.720,209.90,athens,True,3
3,poland,37.970,595.90,wrsaw,True,4
4,cyprus,1.212,24.95,nicosia,True,5

In [82]:
population=pop['population in m']

In [83]:
population.sum()

122.768

In [84]:
population.mean()

24.5536

In [85]:
population.median()

10.72

In [86]:
population.std()

27.72392971423784

* Quantiles are just cut points dividing the probability distribution into continuous intervals with equal probabilities OR deviding the observations in a asample.
* There is one fewer quantile than the number of groups created

In [87]:
population.quantile(0.25)

5.806